#### Terraform Format and Style 🖌`success`
<details><summary>Formatting Output</summary>

```


```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-api-fb-sbx-uks-abb2498b"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-abb2498b"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Api"
        }
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 5000
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 5000
          + transport                  = "tcp"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/api:sbx"
              + memory            = "2Gi"
              + name              = "api"

              + env {
                  + name  = "REDIS_HOST"
                  + value = "ca-redis-fb-sbx-uks-abb2498b"
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
              + env {
                  + name  = "PGUSER"
                  + value = "postgres"
                }
              + env {
                  + name  = "PGHOST"
                  + value = "psql-fb-sbx-uks-abb2498b.postgres.database.azure.com"
                }
              + env {
                  + name  = "PGDATABASE"
                  + value = "fibonacci"
                }
              + env {
                  + name  = "PGPORT"
                  + value = "5432"
                }
              + env {
                  + name  = "PGPASSWORD"
                  + value = "supersecretpassword"
                }
            }
        }
    }

  # azurerm_container_app.client will be created
  + resource "azurerm_container_app" "client" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-client-fb-sbx-uks-abb2498b"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-abb2498b"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Client"
        }
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 3000
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 3000
          + transport                  = "tcp"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/client:sbx"
              + memory            = "2Gi"
              + name              = "client"
            }
        }
    }

  # azurerm_container_app.nginx will be created
  + resource "azurerm_container_app" "nginx" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-nginx-fb-sbx-uks-abb2498b"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-abb2498b"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "NGinx"
        }
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/nginx:sbx"
              + memory            = "2Gi"
              + name              = "nginx"
            }
        }
    }

  # azurerm_container_app.redis will be created
  + resource "azurerm_container_app" "redis" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-redis-fb-sbx-uks-abb2498b"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-abb2498b"
      + revision_mode                 = "Single"
      + workload_profile_name         = "Dedicated"

      + ingress {
          + allow_insecure_connections = false
          + exposed_port               = 6379
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 6379
          + transport                  = "tcp"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "redis:latest"
              + memory            = "2Gi"
              + name              = "redis"
            }
        }
    }

  # azurerm_container_app.worker will be created
  + resource "azurerm_container_app" "worker" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-worker-fb-sbx-uks-abb2498b"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-abb2498b"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Worker"
        }
      + workload_profile_name         = "Dedicated"

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/worker:sbx"
              + memory            = "2Gi"
              + name              = "worker"

              + env {
                  + name  = "REDIS_HOST"
                  + value = "ca-redis-fb-sbx-uks-abb2498b"
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
            }
        }
    }

  # azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id      = (known after apply)
      + default_domain                     = (known after apply)
      + docker_bridge_cidr                 = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_resource_group_name = "rg-cae-infra-fb-sbx-uks-abb2498b"
      + infrastructure_subnet_id           = "/subscriptions/9b882470-ca03-4e89-8f7a-fe80f0755344/resourceGroups/rg-fb-sbx-uks-abb2498b/providers/Microsoft.Network/virtualNetworks/vnet-fb-sbx-uks-abb2498b/subnets/cae"
      + internal_load_balancer_enabled     = false
      + location                           = "uksouth"
      + mutual_tls_enabled                 = false
      + name                               = "cae-fb-sbx-uks-abb2498b"
      + platform_reserved_cidr             = (known after apply)
      + platform_reserved_dns_ip_address   = (known after apply)
      + resource_group_name                = "rg-fb-sbx-uks-abb2498b"
      + static_ip_address                  = (known after apply)
      + tags                               = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Container App Environment"
        }
      + zone_redundancy_enabled            = false

      + workload_profile {
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Fibonacci Infrastructure